# EncryptPlugin

## Description
Encrypt one VectorScript Plug-in file.

```pascal
FUNCTION EncryptPlugin(fullPath : STRING): BOOLEAN;
```

```python
def vs.EncryptPlugin(fullPath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fullPath|STRING|   |

## Remarks
This function is provided by an external plug-in that is not provided by the normal distribution of Vectorworks.

You need to install the <code>Script Batch Process</code> feature from the <code>Vectorworks Developer</code> section of <code>Help → Install Partner Products...</code> menu command.

More info, see here Prepare Release Plugins

Additionally, the plug-in is called ‘BatchEncryption’ and can be found inside ‘ToolsWin’ or ‘ToolsMac’ folders of the corresponding Vectorworks SDKs.

The Vectorworks SDK can be downloaded here:
http://www.vectorworks.net/support/custom/sdk/sdkdown.php

## Examples
```pascal
resultOK := EncryptPlugin('file.txt');
```
```python
import vs

# Encrypt one VectorScript Plug-in file.
fullPath = 'C:/Temp'

ok = vs.EncryptPlugin(fullPath)
if ok:
    vs.Message('EncryptPlugin succeeded')
else:
    vs.Message('EncryptPlugin failed')
```

## See Also
* EncryptAllPlugins
* TestEncryptPlugins

## Version
Availability: from Vectorworks 2014

## Category
* Utility